       IDENTIFICATION          DIVISION.
       PROGRAM-ID.             CADASTRODECLIENTE.
       AUTHOR.                 JULIANO NICOMEDES.
       INSTALLATION.       UNIVERSIDADE PRESBITERIANA MACKENZIE.
       SECURITY.           PROGRAMA DE USO EXCLUSIVO DOS ALUNOS.


       ENVIRONMENT             DIVISION.
       CONFIGURATION           SECTION.
       SPECIAL-NAMES.  DECIMAL-POINT IS COMMA.


       DATA                    DIVISION.
       WORKING-STORAGE         SECTION.

       SCREEN SECTION.
       01 TELA.
         02 L1 LINE 05 COLUMN 15 VALUE "CADASTRO DE CLIENTE".
         02 L2 LINE 10 COLUMN 10 VALUE "DIGITE NUMERO DE MATRICULA".
         02 L21 LINE 10 COLUMN 45 VALUE "(7 DIGITOS)".
         02 L3 LINE 14 COLUMN 10 VALUE "DV CALCULADO:".
         02 L4 LINE 20 COLUMN 10 VALUE "OUTRO CALCULO? (S/N):".


       PROCEDURE DIVISION.


       INICIO.
           DISPLAY TELA.

       FIM.
