       IDENTIFICATION DIVISION.
       PROGRAM-ID.  MOLDURA.
       AUTHOR.      TAKATO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT  IS  COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  CARACTERES.
           02  CANTO-SUP-ESQ   PIC  X.
           02  CANTO-SUP-DIR   PIC  X.
           02  CANTO-INF-ESQ   PIC  X.
           02  CANTO-INF-DIR   PIC  X.
           02  LINHA-DUPL-VERT PIC  X.
           02  LINHA-DUPL-HOR  PIC  X.


       PROCEDURE DIVISION.
       INICIO.
      *    *******    OBTENCAO DE CARACTERES ASCII    *******
           MOVE FUNCTION CHAR (202) TO CANTO-SUP-ESQ.
           MOVE FUNCTION CHAR (188) TO CANTO-SUP-DIR.
           MOVE FUNCTION CHAR (201) TO CANTO-INF-ESQ.
           MOVE FUNCTION CHAR (189) TO CANTO-INF-DIR.
           MOVE FUNCTION CHAR (187) TO LINHA-DUPL-VERT.
           MOVE FUNCTION CHAR (206) TO LINHA-DUPL-HOR.

           DISPLAY ERASE.
      *    *******   MOLDURA MENOR   *******
           DISPLAY CANTO-SUP-ESQ  AT  1010
           DISPLAY CANTO-SUP-DIR  AT  1012
           DISPLAY CANTO-INF-ESQ  AT  1210
           DISPLAY CANTO-INF-DIR  AT  1212
           DISPLAY LINHA-DUPL-HOR  AT  1011
           DISPLAY LINHA-DUPL-HOR  AT  1211
           DISPLAY LINHA-DUPL-VERT  AT  1110
           DISPLAY LINHA-DUPL-VERT  AT  1112.

      *    *******     MOLDURA  MAIOR    *******

           DISPLAY CANTO-SUP-ESQ  AT  0707
           DISPLAY CANTO-SUP-DIR  AT  0715
           DISPLAY CANTO-INF-ESQ  AT  1507
           DISPLAY CANTO-INF-DIR  AT  1515

           DISPLAY LINHA-DUPL-HOR  AT  0708
           DISPLAY LINHA-DUPL-HOR  AT  0709
           DISPLAY LINHA-DUPL-HOR  AT  0710
           DISPLAY LINHA-DUPL-HOR  AT  0711
           DISPLAY LINHA-DUPL-HOR  AT  0712
           DISPLAY LINHA-DUPL-HOR  AT  0713
           DISPLAY LINHA-DUPL-HOR  AT  0714


           DISPLAY LINHA-DUPL-VERT  AT 0807
           DISPLAY LINHA-DUPL-VERT  AT 0907
           DISPLAY LINHA-DUPL-VERT  AT 1007
           DISPLAY LINHA-DUPL-VERT  AT 1107
           DISPLAY LINHA-DUPL-VERT  AT 1207
           DISPLAY LINHA-DUPL-VERT  AT 1307
           DISPLAY LINHA-DUPL-VERT  AT 1407.




           STOP RUN.




