       IDENTIFICATION DIVISION.
       PROGRAM-ID.  PROGRAMA1.
       AUTHOR.      JULIANO.


       ENVIRONMENT DIVISION.

       DATA DIVISION.

       WORKING-STORAGE SECTION.
      *VARIAVEIS

       PROCEDURE DIVISION.
       INICIO.
           DISPLAY "OI" AT 4005.
           STOP " ".
       FIM.



