       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGO.
       AUTHOR. JULIANO.
       ENVIRONMENT  DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       INICIO.
           DISPLAY "OI PESSOAL, TUDO OK" AT 4005
           STOP " ".
       FIM.
