      $SET ACCEPTREFRESH
       IDENTIFICATION DIVISION.
       PROGRAM-ID.  MODULO-CALC-DV.
       AUTHOR.       TAKATO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.  DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  RESTO           PIC 99    VALUE ZEROS.
       01  PESO            PIC 99    VALUE ZEROS.
       01  SOMA            PIC 9(3)  VALUE ZEROS.

       LINKAGE SECTION.
       01 NUMERO PIC 9(7).
       01 DIGITO PIC 9.

       PROCEDURE DIVISION USING NUMERO DIGITO.
       INICIO.
           MOVE 2 TO PESO.
           PERFORM WITH TEST AFTER UNTIL NUMERO = 0
               DIVIDE NUMERO BY 10 GIVING NUMERO REMAINDER RESTO
               COMPUTE SOMA = SOMA + (RESTO * PESO)
               ADD 1 TO PESO
           END-PERFORM.
           DIVIDE SOMA BY 11 GIVING SOMA REMAINDER RESTO.
           IF  RESTO < 2
               MOVE RESTO TO DIGITO
           ELSE
               COMPUTE DIGITO = 11 - RESTO
           END-IF.
       EXIT PROGRAM.

