       IDENTIFICATION DIVISION.
       PROGRAM-ID.  EXEMPLOFOR.
       AUTHOR.      JULIANO.


       ENVIRONMENT DIVISION.
       CONFIGURATION           SECTION.
       SPECIAL-NAMES.  DECIMAL-POINT IS COMMA.


       DATA DIVISION.

       WORKING-STORAGE SECTION.

       77 CONTADOR PIC 999 VALUE ZEROS.

       PROCEDURE DIVISION.

            PERFORM UNTIL CONTADOR > 300
               DISPLAY CONTADOR
               ADD 1 TO CONTADOR
            END-PERFORM.

       FIM.


