      *-----------------------------------------------------------------*
       IDENTIFICATION          DIVISION.
      *-----------------------------------------------------------------*

       PROGRAM-ID.             ENTRADA.
       AUTHOR.                 JULIANO NICOMEDES.
       INSTALLATION.           UNIVERSIDADE PRESBITERIANA MACKENZIE.
       SECURITY.               PROGRAMA DE USO EXCLUSIVO DOS ALUNOS.

      *-----------------------------------------------------------------*
       ENVIRONMENT             DIVISION.
      *-----------------------------------------------------------------*

       CONFIGURATION           SECTION.
       SPECIAL-NAMES.  DECIMAL-POINT IS COMMA.

      *-----------------------------------------------------------------*
       DATA                    DIVISION.
      *-----------------------------------------------------------------*


      *-----------------------------------------------------------------*
       PROCEDURE DIVISION.
      *-----------------------------------------------------------------*
       DISPLAY "CHEGOU NO MODULO DE ENTRADA" AT 2430.
       STOP " ".
       EXIT PROGRAM.
